burgrp/py32-svd/svd/py32m020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>COMP_EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector forinverting input INM</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector fornon-inverting input</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting inputselector for window mode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarityselector</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power modeselector</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_OUT</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filterregister</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>Independent Data register</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset bit</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER3_STOP</name>
              <description>Debug Timer 3 stopped when Core is halted</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>Debug RTC stopped when Core is halted</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>Debug Window Wachdog stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped when Core is halted</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core is halted</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER14_STOP</name>
              <description>Debug Timer 14 stopped when Core is halted</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER16_STOP</name>
              <description>Debug Timer 16 stopped when Core is halted</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIMER17_STOP</name>
              <description>Debug Timer 17 stopped when Core is halted</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
