burgrp/py32-svd/svd/py32m020xx.svd
        <register>
          <name>PUPDR</name>
          <displayName>PUPDR</displayName>
          <description>GPIO port pull-up/pull-downregister</description>
          <addressOffset>0xC</addressOffset>
          <resetValue>0x24000000</resetValue>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD1</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD2</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD3</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD4</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD5</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD6</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD7</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[15:14]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD8</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD9</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD10</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD11</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[23:22]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD12</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD13</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD14</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[29:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUPD15</name>
              <description>Port x configuration bits (y =0..15)</description>
              <bitRange>[31:30]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ID8</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ID9</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ID10</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ID11</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ID12</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ID13</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ID14</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ID15</name>
              <description>Port input data (y =0..15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OD1</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OD2</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OD3</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OD4</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OD5</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OD6</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OD7</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OD8</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OD9</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OD10</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OD11</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OD12</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OD13</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OD14</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OD15</name>
              <description>Port output data (y =0..15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO port bit set/resetregister</description>
          <addressOffset>0x18</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x set bit y (y=0..15)</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset bit y (y =0..15)</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
