burgrp/py32-svd/svd/py32m020xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>Independent watchdog</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <displayName>KR</displayName>
          <description>Key register (IWDG_KR)</description>
          <addressOffset>0x0</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>PR</displayName>
          <description>Prescaler register (IWDG_PR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler divider</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <displayName>RLR</displayName>
          <description>Reload register (IWDG_RLR)</description>
          <addressOffset>0x8</addressOffset>
          <resetValue>0xFFF</resetValue>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reloadvalue</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <displayName>SR</displayName>
          <description>Status register (IWDG_SR)</description>
          <addressOffset>0xC</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler valueupdate</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload valueupdate</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WVU</name>
              <description>Watchdog counter window value update</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WINR</name>
          <displayName>WINR</displayName>
          <description>Window register (IWDG_SR)</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>WIN</name>
              <description>window counter</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LED</name>
      <description>LED CONTROLLER</description>
      <groupName>LED</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LED</name>
        <description>LED global Interrupt</description>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>LED_CR</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LEDON</name>
              <description>LED enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LED_COM_SEL</name>
              <description>LED COM Selection</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE</name>
              <description>LED interrupt enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EHS</name>
              <description>Light control</description>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <displayName>LED_PR</displayName>
          <description>Prescaler register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler control</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <displayName>LED_TR</displayName>
          <description>Time register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>T1</name>
              <description>Light on time</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T2</name>
              <description>Switch time</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR0</name>
          <displayName>LED_DR0</displayName>
          <description>Data0 register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DATA0_A</name>
              <description>8-bit data register</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATA0_B</name>
              <description>8-bit data register</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DATA0_C</name>
              <description>8-bit data register</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DATA0_D</name>
              <description>8-bit data register</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DATA0_E</name>
              <description>8-bit data register</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DATA0_F</name>
              <description>8-bit data register</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DATA0_G</name>
              <description>8-bit data register</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DATA0_DP</name>
              <description>8-bit data register</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR1</name>
          <displayName>LED_DR1</displayName>
          <description>Data1 register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DATA1_A</name>
              <description>8-bit data register</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATA1_B</name>
              <description>8-bit data register</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DATA1_C</name>
              <description>8-bit data register</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DATA1_D</name>
              <description>8-bit data register</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DATA1_E</name>
              <description>8-bit data register</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DATA1_F</name>
              <description>8-bit data register</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DATA1_G</name>
              <description>8-bit data register</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DATA1_DP</name>
              <description>8-bit data register</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR2</name>
          <displayName>LED_DR2</displayName>
          <description>Data2 register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DATA2_A</name>
              <description>8-bit data register</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATA2_B</name>
              <description>8-bit data register</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DATA2_C</name>
              <description>8-bit data register</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DATA2_D</name>
              <description>8-bit data register</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DATA2_E</name>
              <description>8-bit data register</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DATA2_F</name>
              <description>8-bit data register</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DATA2_G</name>
              <description>8-bit data register</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DATA2_DP</name>
              <description>8-bit data register</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR3</name>
          <displayName>LED_DR3</displayName>
          <description>Data3 register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>DATA3_A</name>
              <description>8-bit data register</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DATA3_B</name>
              <description>8-bit data register</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DATA3_C</name>
              <description>8-bit data register</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DATA3_D</name>
              <description>8-bit data register</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DATA3_E</name>
              <description>8-bit data register</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DATA3_F</name>
              <description>8-bit data register</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DATA3_G</name>
              <description>8-bit data register</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DATA3_DP</name>
              <description>8-bit data register</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IR</name>
          <displayName>LED_IR</displayName>
          <description>Interrupt register 1</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>FLAG</name>
              <description>interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
