burgrp/py32-svd/svd/py32m020xx.svd
        <register>
          <name>CCMR2_Input</name>
          <displayName>CCMR2_Input</displayName>
          <description>capture/compare mode register 2 (inputmode)</description>
          <alternateRegister>CCMR2_Output</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CC3S</name>
              <description>Capture/compare 3selection</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3PSC</name>
              <description>Input capture 3 prescaler</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC3F</name>
              <description>Input capture 3 filter</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <description>Capture/Compare 4selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4PSC</name>
              <description>Input capture 4 prescaler</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC4F</name>
              <description>Input capture 4 filter</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <displayName>CCER</displayName>
          <description>capture/compare enableregister</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>CC1E</name>
              <description>Capture/Compare 1 outputenable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <description>Capture/Compare 1 outputPolarity</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1NE</name>
              <description>Capture/Compare 1 complementary outputenable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC1NP</name>
              <description>Capture/Compare 1 outputPolarity</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <description>Capture/Compare 2 outputenable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <description>Capture/Compare 2 outputPolarity</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC2NE</name>
              <description>Capture/Compare 2 complementary outputenable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CC2NP</name>
              <description>Capture/Compare 2 outputPolarity</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <description>Capture/Compare 3 outputenable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <description>Capture/Compare 3 outputPolarity</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC3NE</name>
              <description>Capture/Compare 3 complementary outputenable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3NP</name>
              <description>Capture/Compare 3 outputPolarity</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <description>Capture/Compare 4 outputenable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <description>Capture/Compare 3 outputPolarity</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <displayName>CNT</displayName>
          <description>counter</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <description>counter value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <displayName>PSC</displayName>
          <description>prescaler</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <description>Prescaler value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <displayName>ARR</displayName>
          <description>auto-reload register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <description>Auto-reload value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <displayName>RCR</displayName>
          <description>repetition counter register</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>REP</name>
              <description>Repetition counter value</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <displayName>CCR1</displayName>
          <description>capture/compare register 1</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <description>Capture/Compare 1 value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <displayName>CCR2</displayName>
          <description>capture/compare register 2</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CCR2</name>
              <description>Capture/Compare 2 value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <displayName>CCR3</displayName>
          <description>capture/compare register 3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CCR3</name>
              <description>Capture/Compare value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <displayName>CCR4</displayName>
          <description>capture/compare register 4</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CCR4</name>
              <description>Capture/Compare value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <displayName>BDTR</displayName>
          <description>break and dead-time register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <description>Dead-time generator setup</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <value>128</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock configuration</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSSI</name>
              <description>Off-state selection for Idlemode</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <description>Off-state selection for Runmode</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <description>Break enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <description>Break polarity</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <description>Automatic output enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <description>Main output enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <displayName>DCR</displayName>
          <description>DMA control register</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <description>DMA base address</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBL</name>
              <description>DMA burst length</description>
              <bitRange>[12:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <displayName>DMAR</displayName>
          <description>DMA address for full transfer</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <description>DMA register for burstaccesses</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
